thanhbinh89/esp32-ipc/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_SPIRAM=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# OV5647 MIPI sensor, RAW10 1920x1080 30fps -> ISP -> YUV420
CONFIG_CAMERA_OV5647=y
CONFIG_CAMERA_OV5647_AUTO_DETECT_MIPI_INTERFACE_SENSOR=y
CONFIG_CAMERA_OV5647_MIPI_RAW10_1920X1080_30FPS=y
CONFIG_CAMERA_OV5647_MIPI_DEFAULT_FMT_RAW10_1920X1080_30FPS=y
CONFIG_CAMERA_OV5647_DEFAULT_IPA_JSON_CONFIGURATION_FILE=y

# esp_video devices: MIPI-CSI capture + ISP + hardware H.264 encoder
CONFIG_ESP_VIDEO_ENABLE_ISP_VIDEO_DEVICE=y
CONFIG_ESP_VIDEO_ENABLE_HW_H264_VIDEO_DEVICE=y

# Custom partition table (4MB app for esp-dl model + H.264)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# esp_hosted is pulled in by the esp_wifi_remote dependency, and its host init is a
# global constructor that grabs ~39 KB of internal DMA RAM before app_main. Ethernet
# builds do not need it. APP_NETIF_WIFI selects it back on.
# CONFIG_ESP_HOSTED_ENABLED is not set

# WebRTC (libpeer): DTLS-SRTP + PSRAM-backed mbedtls allocations
CONFIG_MBEDTLS_SSL_PROTO_DTLS=y
CONFIG_MBEDTLS_SSL_DTLS_SRTP=y
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
